Dating app backend/app/controllers/messages_controller.rb

    def index
        messages=Message.all
---
SELECT "messages".* FROM "messages"

    def create
        @message=Message.new(user_id: params[:user_id], sender_id: params[:sender_id], message: params[:message])

        if @message.save
---
INSERT INTO "messages" ("message", "user_id", "sender_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["message", "SDFASDF"], ["user_id", 145], ["sender_id", 148], ["created_at", "2020-07-08 16:04:15.426775"], ["updated_at", "2020-07-08 16:04:15.426775"]]

    def destroy
        message=Message.find(params[:id])
        message.destroy
---
SELECT "messages".* FROM "messages" WHERE "messages"."id" = $1 LIMIT $2  [["id", 49], ["LIMIT", 1]]
DELETE FROM "messages" WHERE "messages"."id" = $1  [["id", 49]]