Dating app backend/app/controllers/terms_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "test1"], ["LIMIT", 1]]
DELETE FROM "terms" WHERE "terms"."id" = $1  [["id", 86]]
INSERT INTO "terms" ("terms", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
    def create
      username = term_params['username']
      user = User.all.find_by(username: username)

      terms = term_params['terms'].join(' ')

      user.terms.destroy_all

      term = Term.new(terms: terms, user_id: user.id)

      term.save

SELECT "terms".* FROM "terms"
---
    def index
      @terms = Term.all