Dating app backend/app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "avatar", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
INSERT INTO "terms" ("terms", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["terms", ""], ["user_id", 255], ["created_at", "2020-07-08 20:05:54.962401"], ["updated_at", "2020-07-08 20:05:54.962401"]]
---
    def create
      user = User.new(user_params)

      if user.valid?
        user.avatar="https://picsum.photos/#{rand(1..300)}"
        user.save
        Term.create(terms: "", user_id:user.id)